test007/raw_logs/s1_baseline-b2_short_prompt_med_qps.log
Pre-resolved vllm-target-test007-s1-baseline -> [10.107.155.206]
Loading tokenizer: Qwen2.5-0.5B-Instruct
No tokenizer.json for 'Qwen2.5-0.5B-Instruct', trying tiktoken format...
Tiktoken also not available (Tokenizer error: No tiktoken model file found for 'Qwen2.5-0.5B-Instruct'), trying server-side tokenization...
Tokenizer: Server (vocab_size≈131072)
Tokenizer loaded successfully.
Generating 2 random prompts...
Generated 2 prompts in 0.02s
Tokenizer verified in previous run (cached), skipping verification.
Starting main benchmark run...
Traffic request rate: 4
Burstiness factor: 1 (Poisson process)
Maximum request concurrency: 2
================= Serving Benchmark Result =================
Successful requests:                     2         
Failed requests:                         0         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  1.71      
Total input tokens:                      1024      
Total generated tokens:                  256       
Request throughput (req/s):              1.17      
Output token throughput (tok/s):         149.94    
Peak output token throughput (tok/s):    169.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          749.70    
--------------------Time to First Token---------------------
Mean TTFT (ms):                          27.44     
Median TTFT (ms):                        27.44     
P99 TTFT (ms):                           28.88     
P90 TTFT (ms):                           28.62     
----------Time per Output Token (excl. 1st token)-----------
Mean TPOT (ms):                          9.72      
Median TPOT (ms):                        9.72      
P99 TPOT (ms):                           10.16     
P90 TPOT (ms):                           10.08     
--------------------Inter-token Latency---------------------
Mean ITL (ms):                           9.72      
Median ITL (ms):                         9.07      
P99 ITL (ms):                            24.53     
P90 ITL (ms):                            10.79     
---------------------End-to-end Latency---------------------
Mean E2EL (ms):                          1261.65   
Median E2EL (ms):                        1261.65   
P99 E2EL (ms):                           1316.54   
P90 E2EL (ms):                           1306.45   
============================================================
Results saved to /results/test007/raw_json/s1_baseline-b2_short_prompt_med_qps.json

Open-file limit: 1048576