test007/raw_logs/s1_baseline-b4_med_prompt_low_qps.log
Pre-resolved vllm-target-test007-s1-baseline -> [10.107.155.206]
Loading tokenizer: Qwen2.5-0.5B-Instruct
No tokenizer.json for 'Qwen2.5-0.5B-Instruct', trying tiktoken format...
Tiktoken also not available (Tokenizer error: No tiktoken model file found for 'Qwen2.5-0.5B-Instruct'), trying server-side tokenization...
Tokenizer: Server (vocab_size≈131072)
Tokenizer loaded successfully.
Generating 2 random prompts...
Generated 2 prompts in 0.04s
Tokenizer verified in previous run (cached), skipping verification.
Starting main benchmark run...
Traffic request rate: 1
Burstiness factor: 1 (Poisson process)
Maximum request concurrency: 2
================= Serving Benchmark Result =================
Successful requests:                     2         
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  7.12      
Total input tokens:                      4096      
Total generated tokens:                  1024      
Request throughput (req/s):              0.28      
Output token throughput (tok/s):         143.88    
Peak output token throughput (tok/s):    204.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          719.39    
--------------------Time to First Token---------------------
Mean TTFT (ms):                          154.90    
Median TTFT (ms):                        154.90    
P99 TTFT (ms):                           233.25    
P90 TTFT (ms):                           218.86    
----------Time per Output Token (excl. 1st token)-----------
Mean TPOT (ms):                          9.89      
Median TPOT (ms):                        9.89      
P99 TPOT (ms):                           9.91      
P90 TPOT (ms):                           9.91      
--------------------Inter-token Latency---------------------
Mean ITL (ms):                           9.89      
Median ITL (ms):                         9.57      
P99 ITL (ms):                            14.38     
P90 ITL (ms):                            11.08     
---------------------End-to-end Latency---------------------
Mean E2EL (ms):                          5209.00   
Median E2EL (ms):                        5209.00   
P99 E2EL (ms):                           5299.48   
P90 E2EL (ms):                           5282.86   
============================================================
Results saved to /results/test007/raw_json/s1_baseline-b4_med_prompt_low_qps.json

Open-file limit: 1048576